#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

// Массив со словами для отгадывания
char *words[] = {
        "яблоко",
        "груша",
        "апельсин",
        "виноград",
        "лимон",
        "персик",
        "слива",
        "клубника",
        "малина"
};
int endGame = 0; // флаг завершения игры
int help = 0; // флаг подсказки


// Функция для проверки, является ли символ русской буквой
int cyrillicaTest(char c) {
    return (c >= 'а' && c <= 'я') || (c >= 'А' && c <= 'Я');
}

int helpTest(int p) {
    if (p == '?') {
        help = 1;
        return 1;
    }

    return 0;
}

// Функция для проверки, была ли буква уже введена
int letterTest(const char *guessed_word, char guess) {

    for (int i = 0; guessed_word[i] != '\0'; ++i) {
        if (help == 1) {
            if (i != 0) {
                if (i != 2) { // исключаем из проверки буквы подсказки (через || не захотело работать)
                    if (guessed_word[i] == guess) {
                        return 1;
                    }
                }
            }
        } else if (guessed_word[i] == guess) {
            return 1;
        }
    }

    return 0;
}

int main() {
    printf("\n┌─────────────────────────────────────────────┐"
           "\n│     Добро пожаловать в игру 'Висилица'      │"
           "\n└─────────────────────────────────────────────┘"
           "\n           Цель: Отгадать слово                "
           "\n        (если слаб духом вводи - ?)          \n");

    srand(time(NULL)); // Инициализация генератора случайных чисел

    int num_words = sizeof(words) / sizeof(char *);
    char *word_to_guess = words[rand() % num_words]; // Выбираем случайное слово

    int word_length = strlen(word_to_guess);
    char guessed_word[word_length + 1];
    memset(guessed_word, '_', word_length); // Заполняем массив подчеркиваниями
    guessed_word[word_length] = '\0'; // Завершаем строку нулевым символом


    int max_attempts = 6; // Максимальное количество попыток
    int attempts_left = max_attempts;
    int correct_guesses = 2; // Счетчик отгаданных буквы (изначально 2 т.к. включены буквы подсказки)

    while (attempts_left > 0 && correct_guesses != word_length) {

        printf("\n├──────────────────────────────────────────"
               "\n│ Осталось попыток: %d"
               "\n├──────────────────────────────────────────"
               "\n│ Отгадайте слово: %s"
               "\n├──────────────────────────────────────────", attempts_left, guessed_word);

        char guess;
        do {
            printf("\n│ Введите букву: ");
            scanf(" %c", &guess);

            printf(" %c", helpTest(guess));
            if (helpTest(guess)) {
                // Добавление первой и третей буквы в качестве подсказок
                guessed_word[0] = word_to_guess[0];
                guessed_word[2] = word_to_guess[2];
                printf("\n├──────────────────────────────────────────"
                       "\n│ Внимание! Активирована подсказка! Ах ты негодник!... :) "
                       "\n├──────────────────────────────────────────"
                       "\n│ Отгадайте слово: %s"
                       "\n├──────────────────────────────────────────", guessed_word);

            } else if (!cyrillicaTest(guess)) { //Проверка на киррилицу
                printf("\n├──────────────────────────────────────────"
                       "\n│ Пожалуйста, введите букву русского алфавита."
                       "\n├──────────────────────────────────────────");
            } else if (letterTest(guessed_word, guess)) { //Проверка буквы в слове
                printf("\n├──────────────────────────────────────────"
                       "\n│ Вы уже ввели эту букву. Попробуйте другую."
                       "\n├──────────────────────────────────────────");
            }
        } while (!cyrillicaTest(guess) || letterTest(guessed_word, guess));

        // Цикл проверки буквы в заданном слове
        int found = 0;
        for (int i = 0; i < word_length; ++i) {
            if (i != 0) {
                if (i != 2) {
                    if (word_to_guess[i] == guess) { // Если в ячейке найдена буква то...
                        guessed_word[i] = guess;
                        found = 1;
                        correct_guesses++;
                    }
                }
            }
        }

        if (!found) {
            attempts_left--;
            printf("\n├──────────────────────────────────────────"
                   "\n│ Неверная попытка! Осталось %d попыток."
                   "\n├──────────────────────────────────────────", attempts_left);
        } else {
            printf("\n├──────────────────────────────────────────"
                   "\n│ Правильно! Буква добавлена в нужное место! ;) "
                   "\n├──────────────────────────────────────────");
        }
    }

    if (correct_guesses == word_length) {
        printf("\n├──────────────────────────────────────────"
               "\n│ Поздравляем! Вы отгадали слово: %s"
               "\n├──────────────────────────────────────────", word_to_guess);
    } else {
        printf("\n├──────────────────────────────────────────"
               "\n│ К сожалению, вы проиграли. Правильное слово было: %s"
               "\n├──────────────────────────────────────────", word_to_guess);
    }

    printf("\n┌─────────────────────────────────────────────┐"
           "\n│       Нажмите 'Enter' для выхода...         │"
           "\n└─────────────────────────────────────────────┘\n");
    scanf("");

    getchar();
    getchar();

    return 0;


}
