void hello() {
    printf("\n-----------------------------------------------┐"
           "\n│         Добро пожаловать в игру              │"
           "\n│  г==┐  г┐г┐ г==┐ г===┐  г==┐ г┐г┐ г┐г┐ г==┐  │"
           "\n│  │г┐│  ││││ │г=- │г==-  │г┐│ ││││ ││││ │г┐│  │"
           "\n│  │L-L┐ ││││ ││   │L==┐  ││││ ││││ ││││ │L-│  │"
           "\n│  │г=┐│ ││г│ ││   │г==-  ││││ ││г│ ││││ │г┐│  │"
           "\n│  │L=-│ │L-│ │L=┐ │L==┐ г-│││ │L-│ │L-│ ││││  │"
           "\n│  L===- L==- L==- L===- L=-L- L==- L==┐ L-L-  │"
           "\n│ Разработчик:Б.В.Дорецкий  группа:ИВТ-ПОб24о-1│"
           "\nL-----------------------------------------------"
           "\nЦель игры:  Игроку загадывается слово, которое "
           "\nон должен угадать, используя буквы русского алфавита. "
           "\nДопустимо ошибок: 6             "
           "\nВажно! Вводи '?' если нужна подсказка (доступна 1 раз)  \n");
}
